import pandas as pd
import requests


def export_to_csv_prediction(xTESTPredict):
    # xTESTPredict = [  
    #                 5.17253565,  5.18903036,  5.20552508,  5.22201979,  5.2385145,     # 9:00 - 10:00
    #                 6.29289965,  6.30939436,  6.32588907,  6.34238378,  6.3588785,     # 10:00 - 11:00
    #                 7.41326364,  7.42975836,  7.44625307,  7.46274778,  7.47924249,    # 11:00 - 12:00
    #                 8.53362764,  8.55012235,  8.56661707,  8.58311178,  8.59960649,    # 12:00 - 13:00
    #                 9.65399164,  9.67048635,  9.68698106,  9.70347577,  9.71997049,    # 13:00 - 14:00
    #                 10.77435563, 10.79085035, 10.80734506, 10.82383977, 10.84033448,    # 14:00 - 15:00
    #                 11.89471963, 11.91121434, 11.92770906, 11.94420377, 11.96069848,    # 15:00 - 16:00
    #                 13.01508363, 13.03157834, 13.04807305, 13.06456776, 13.08106248,    # 16:00 - 17:00
    #                 14.13544762, 14.15194234, 14.16843705, 14.18493176                  # 17:00 - 18:00
    #             ]       # пн        вт            ср          чт            пт

    lastday = 4  # день конца рабочей недели в офисе

    # list_time_interval = {0:  '9:00 - 10:00',
    #                     1:  '10:00 - 11:00',
    #                     2:  '11:00 - 12:00',
    #                     3:  '12:00 - 13:00',
    #                     4:  '14:00 - 15:00',
    #                     5:  '15:00 - 16:00',
    #                     6:  '16:00 - 17:00',
    #                     7:  '17:00 - 18:00',
    #                     8:  '18:00 - 19:00',
    #                     9:  '20:00 - 21:00',
    #                     10: '21:00 - 22:00'}
    # list_week = {0: "Пн",
    #             1: "Вт",
    #             2: "Ср",
    #             3: "Чт",
    #             4: "Пт",
    #             5: "Сб",
    #             6: "Вс",
    #             }

    my_df = []

    day = 0
    time_day = 0
    for i in range(0, len(xTESTPredict)):
        my_df.append({
            'BankID': 'Bank1',
            'FunctionList': "Functions1",
            'Time': time_day,
            'Day': day,
            'Predict': xTESTPredict[i]
        })

        if (day == lastday):
            day = -1
            time_day += 1
        day += 1

    # print()
    df = pd.DataFrame(my_df)

    # displaying the DataFrame 
    print('DataFrame:\n', df)

    # saving the DataFrame as a CSV file 
    gfg_csv_data = df.to_csv('prediction_week.csv', index=True)
    print('\nCSV String:\n', gfg_csv_data)
    return 'prediction_week.csv'
